import pyxel


def initialize():
    # グラフィックス
    # イメージバンク0に，座標0,0を左上の端のドットとして，16x16のイメージを書き込む
    # ドットの色を16進数の1数字で表している (0~f)
    pyxel.images[0].set(
        0,
        0,
        [
            "0000cc8888cc0000",
            "0000cc8888cc0000",
            "0000cc777777cc00",
            "0000cc777777cc00",
            "0000cc77888877c0",
            "0000cc77888877c0",
            "cccc778833bb877c",
            "cccc778833bb077c",
            "7777778333387777",
            "7777778333387777",
            "778855cccc558877",
            "778855cccc558877",
            "8855cc7777cc5588",
            "8855cc7777cc5588",
            "00cc00888800cc00",
            "00cc00888800cc00"])

    # サウンド
    # サウンド0, 1に音を適当に設定
    # pyxel.sound(0).set("a3a2c1a1", "p", "7", "s", 5)
    # pyxel.sound(1).set("a3a2c2c2", "n", "7742", "s", 5)
    pyxel.sounds[0].set("a3a2c1a1", "p", "7", "s", 5)
    pyxel.sounds[1].set("a3a2c2c2", "n", "7742", "s", 5)


if __name__=="__main__":
    pyxel.init(256, 256)
    initialize()
